## cloudtrail_data_lake plan
```
module.github-cloudtrail-auditlog.data.archive_file.github_s3_reader_function: Reading...
module.github-cloudtrail-auditlog.data.archive_file.github_ingest_function: Reading...
module.github-cloudtrail-auditlog.data.aws_partition.current: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_assume_role: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_assume_role: Reading...
module.github-cloudtrail-auditlog.data.aws_region.current: Reading...
module.github-cloudtrail-auditlog.data.aws_caller_identity.current: Reading...
module.github-cloudtrail-auditlog.aws_ssm_parameter.github_audit_allow_list: Refreshing state... [id=/github/GitHubAuditAllowList]
module.github-cloudtrail-auditlog.aws_ssm_parameter.github_cloudtrail_channel: Refreshing state... [id=/github/GitHubCloudTrailChannel]
module.github-cloudtrail-auditlog.data.aws_partition.current: Read complete after 0s [id=aws]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_assume_role: Read complete after 0s [id=2690255455]
module.github-cloudtrail-auditlog.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_assume_role: Read complete after 0s [id=2690255455]
module.github-cloudtrail-auditlog.data.aws_caller_identity.current: Read complete after 0s [id=880656497252]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.bucket_policy: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_encryption_key: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.bucket_policy: Read complete after 0s [id=2608418455]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_encryption_key: Read complete after 0s [id=1684911374]
module.github-cloudtrail-auditlog.aws_kms_key.github_encryption_key: Refreshing state... [id=f3ab0b07-059d-4319-aeab-bf5acf94eafc]
module.github-cloudtrail-auditlog.data.archive_file.github_s3_reader_function: Read complete after 0s [id=53e5be98f31264b4b8e3cbf466bdc1112f91d578]
module.github-cloudtrail-auditlog.data.archive_file.github_ingest_function: Read complete after 0s [id=67f7bbdbb3b225eb9e39ad15905bdeb22ce4b87b]
module.github-cloudtrail-auditlog.aws_cloudwatch_log_group.github_s3_reader_loggroup: Refreshing state... [id=/aws/lambda/GitHubS3ReaderFunction]
module.github-cloudtrail-auditlog.aws_kms_alias.github_encryption_key: Refreshing state... [id=alias/GitHubCloudTrailOpenEvent]
module.github-cloudtrail-auditlog.aws_cloudwatch_log_group.github_ingest_loggroup: Refreshing state... [id=/aws/lambda/GitHubIngestFunction]
module.github-cloudtrail-auditlog.aws_sqs_queue.github_s3_reader_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/GitHubS3ReaderDLQ]
module.github-cloudtrail-auditlog.aws_sqs_queue.github_transform_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/githubTransformDLQ.fifo]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_transform_dlq: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_transform_dlq: Read complete after 0s [id=1284191353]
module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_transform_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/githubTransformDLQ.fifo]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue_dlq: Reading...
module.github-cloudtrail-auditlog.aws_sqs_queue.github_s3_reader_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/GitHubS3ReaderQueue]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue_dlq: Read complete after 0s [id=1166629170]
module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_s3_reader_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/GitHubS3ReaderDLQ]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_role: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue: Read complete after 0s [id=2694101608]
module.github-cloudtrail-auditlog.aws_iam_role.github_s3_reader: Refreshing state... [id=GitHubS3ReaderFunctionRole]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_role: Read complete after 0s [id=1348853844]
module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_s3_reader_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/880656497252/GitHubS3ReaderQueue]
module.github-cloudtrail-auditlog.aws_iam_role.github_ingest: Refreshing state... [id=GitHubIngestFunctionRole]
module.github-cloudtrail-auditlog.aws_lambda_function.github_ingest: Refreshing state... [id=GitHubIngestFunction]
module.github-cloudtrail-auditlog.aws_lambda_function.github_s3_reader: Refreshing state... [id=GitHubS3ReaderFunction]
module.github-cloudtrail-auditlog.aws_lambda_permission.github_s3_reader_function_event: Refreshing state... [id=GitHubS3ReaderFunctionEvent]
module.github-cloudtrail-auditlog.aws_lambda_permission.github_ingest_function_event: Refreshing state... [id=GitHubIngestFunctionEvent]
module.github-cloudtrail-auditlog.aws_lambda_event_source_mapping.github_s3_reader_queue_to_lambda: Refreshing state... [id=fa421769-5d18-4034-8da0-5faba6fea9f1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "github_s3_reader_function_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::test-github-enterprise-audit/*",
            ]
          + sid       = "AllowReadS3Bucket"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:eu-west-2:880656497252:key/f3ab0b07-059d-4319-aeab-bf5acf94eafc",
            ]
          + sid       = "AllowKMSToEncryptSQSMessage"
        }
      + statement {
          + actions   = [
              + "sqs:GetQueueAttributes",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-2:880656497252:GitHubS3ReaderQueue",
            ]
          + sid       = "AllowSQSSendMessage"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-2:880656497252:parameter/github/GitHubAuditAllowList",
            ]
          + sid       = "AllowSSMParameterAccess"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubS3ReaderFunction:*:*",
            ]
          + sid       = "AllowToWriteCloudWatchLog"
        }
    }

  # module.github-cloudtrail-auditlog.aws_iam_role.github_s3_reader will be updated in-place
  ~ resource "aws_iam_role" "github_s3_reader" {
        id                    = "GitHubS3ReaderFunctionRole"
        name                  = "GitHubS3ReaderFunctionRole"
        tags                  = {}
        # (10 unchanged attributes hidden)

      - inline_policy {
          - name   = "github_s3_reader_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::test-github-enterprise-audit/*"
                          - Sid      = "AllowReadS3Bucket"
                        },
                      - {
                          - Action   = [
                              - "kms:GenerateDataKey",
                              - "kms:Decrypt",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:kms:eu-west-2:880656497252:key/f3ab0b07-059d-4319-aeab-bf5acf94eafc"
                          - Sid      = "AllowKMSToEncryptSQSMessage"
                        },
                      - {
                          - Action   = [
                              - "sqs:SendMessage",
                              - "sqs:GetQueueAttributes",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:eu-west-2:880656497252:GitHubS3ReaderQueue"
                          - Sid      = "AllowSQSSendMessage"
                        },
                      - {
                          - Action   = "ssm:GetParameter"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ssm:eu-west-2:880656497252:parameter/github/GitHubAuditAllowList"
                          - Sid      = "AllowSSMParameterAccess"
                        },
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubS3ReaderFunction:*:*"
                          - Sid      = "AllowToWriteCloudWatchLog"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "github_s3_reader_policy"
          + policy = (known after apply)
        }
    }

  # module.github-cloudtrail-auditlog.aws_lambda_function.github_ingest will be updated in-place
  ~ resource "aws_lambda_function" "github_ingest" {
        id                             = "GitHubIngestFunction"
      ~ last_modified                  = "2024-04-10T13:47:57.138+0000" -> (known after apply)
      ~ source_code_hash               = "vtOEv8NQZG1O8qG708wFtcvuKml/s4G2Kh78mizwcDw=" -> "E93yJ7ecKdJQ20Uf39DSLhrnlfy3lTuN2Jxk1979qj0="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.github-cloudtrail-auditlog.aws_lambda_function.github_s3_reader will be updated in-place
  ~ resource "aws_lambda_function" "github_s3_reader" {
        id                             = "GitHubS3ReaderFunction"
      ~ last_modified                  = "2024-04-10T13:49:21.150+0000" -> (known after apply)
      ~ source_code_hash               = "NEVVwZWzMI1VRAn6XjPcerdoWsP3STrjWKC/VTNWqZ8=" -> "6h8MABpaXB2YpGItWI6WHO4Xk09RvE9Bu5fH4UDgzdw="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.github-cloudtrail-auditlog.aws_ssm_parameter.github_audit_allow_list will be updated in-place
  ~ resource "aws_ssm_parameter" "github_audit_allow_list" {
        id             = "/github/GitHubAuditAllowList"
      + insecure_value = (known after apply)
        name           = "/github/GitHubAuditAllowList"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```